Repository: GabriellaManunta/g3w-admin
Catalog: g3w-admin/core/locale/*/LC_MESSAGES/django.po
Languages: it

source: Basic settings
it: Configurazioni di base

source: Access settings
it: Accesso configurazioni

source: Display settings
it: Mostra le configurazioni

source: Additional settings
it: Configurazioni accessorie

source: Data are not correct or insufficent!
it: I dati non sono corretti o insufficenti

source: A error server is occured!
it: Si è verificato un errore server!

source: Not found
it: Non trovato

source: Permission denied
it: Permesso negato

source: Search
it: Ricerca

source: Law
it: Normativa

source: General data
it: Dati generali

source: GEO data
it: GEO dati

source: Base Layers and Map default features
it: Layers di base e caratteristiche di default della mappa

source: Logo/Picture
it: Logo/Immagine

source: Frontend home data
it: Dati home

source: Frontend about data
it: Dati chi siamo

source: Frontend groups map data
it: Dati gruppi di mappa del frontend

source: Frontend login data
it: Dati login frontend

source: Frontend social data
it: Dati social media

source: Map control
it: Controllo di mappa

source: Map controls
it: Cantrolli di mappa

source: Title
it: Titolo

source: Description
it: Descrizione

source: Logo image
it: Immagine logo

source: Logo link
it: Link logo

source: Enter link with http:// or https//
it: Il link deve contenere http:// or https//

source: Name
it: Nome

source: Is active
it: Attivo

source: lang
it: Lunguaggio

source: Terms of use text
it: Termi di utilizzo

source: Terms of use link
it: Link termini di utilizzo

source: Group
it: Gruppo

source: Project type
it: Tipo di progetto

source: Project type id
it: Id tipo di progetto

source: Subtitle
it: Sottotitolo

source: Home description
it: Descrizione home

source: About title
it: Titolo sezione 'Il progetto'

source: About description
it: Descrizione pagina 'Il progetto'

source: About name
it: Nome del progetto

source: About phone
it: Telefono del progetto

source: About email
it: Email del progetto

source: About address
it: Indirizzo del progetto

source: Groups title
it: Titolo pagina gruppi cartografici

source: Groups map description
it: Descrizione pagina gruppi cartografici

source: Login description
it: Descrizione pagina di login

source: Suite logo
it: Logo del progetto

source: error page
it: Pagine di errore

source: Access denied
it: Accesso negato

source: You can't add new Group
it: Non puoi aggiungere un nuovo gruppo

source: You can't add new Project
it: Non puoi aggiungere un nuovo progetto

source: Geografic component
it: Componente geografica

source: Geographic coordinate system
it: Sistema di coordinate geografiche

source: Units
it: Unità

source: Principal map
it: Mappa principale

source: Max scale
it: Massima scala

source: Min scale
it: Minima scala

source: Overview Map
it: Mappa di riferimento

source: Users
it: Utenti

source: Editor user
it: Utente Editor

source: Viewer users
it: Utenti Viewers

source: Interface component
it: Componente di interfaccia

source: Interface language
it: Lingua interfaccia

source: Language
it: Lingua

source: Associated logo
it: Logo associato

source: Terms of use
it: Condizioni di utilizzo

source: Drop files here to upload
it: Rilascia i files qui per caricarli

source: Click or Drag file to Upload
it: Clicca o trascina i file per caricarlo

source: Processing dropped files...
it: Processamento dei file inviati...

source: Cancel
it: Annulla

source: Retry
it: Riprova

source: Delete
it: Elimina

source: General suite data
it: Dati generali della suite

source: Alert
it: Attenzione

source: Some errors on form. Check it and send again.
it: Si sono verificati alcuni errori sul form. Controlla e reinvia.

source: Projects
it: Progetti

source: Cartographic groups
it: Gruppi cartografici

source: Add new project
it: Aggiungi un nuovo progetto

source: Group projects
it: Progetti del gruppo

source: Show detail
it: Mostra i dettagli

source: Edit
it: Modifica

source: Select project type do add:
it: Selezione il tipo di progetto da aggiungere:

source: This website uses cookies to ensure you get the best experience on our website
it: Questo sito utilizza i coockie per garantire una buona usabilità all'utilizzatore finale

source: Got it
it: Capito

source: Save
it: Salva

source: Redo/Back
it: Annulla/indietro

source: Project
it: Progetto

source: {} is no a valid image
it: {} non è una immagine valida

source: Default base layer
it: Layer base di default

source: Yes
it: Si
