Repository: GabriellaManunta/g3w-admin
Catalog: docs/locales/*/LC_MESSAGES/user_groups_organization.po
Languages: it

source: Hierarchical organization of WebGis services and types of Users (roles)
it: Organizzazione gerarchica dei servizi WebGis e Tipologie di Utenti (Ruoli)

source: This paragraph allows you to understand how G3W-SUITE makes it possible to manage the individual WebGis services in a structured and hierarchical way.
it: _**Questo paragrafo permette di comprendere come G3W-SUITE renda possibile gestire in modo strutturato e gerarchico i singoli servizi WebGis.**_

source: The organizational levels are two:
it: I livelli organizzativi dei servizi webgis sono:

source: Cartographic MacroGroups
it: **`MacroGruppi Cartografici`**

source: Cartographic groups
it: **`Gruppi Cartografici`**

source: These organizational levels can be associated with different types of users (Editor 1, Editor2 and Viewer) in order to manage the access / management powers to the individual elements in a granular way
it: **Tali livelli organizzativi possono essere associati a diverse tipologie di utenti (Editor 1, Editor2 e Viewer) al fine di gestire in modo granulare i poteri di accesso/gestione ai singoli elementi**

source: The example shown in the following graph is that relating to the case of a Union of Municipalities where we need to organize the various WebGis services in containers that identify the individual municipal administrations and individual services.
it: L’esempio riportato nel grafico seguente è quello relativo al caso di un Unione dei Comuni dove abbiamo la necessità di organizzare i diversi servizi WebGis in contenitori che identifichino le singole Amministrazioni Comunali e i singoli Servizi.

source: Access policies and individual functional modules may be associated with each WebGis service.
it: Ad ogni servizio WebGis potranno essere associati politiche di accesso e singoli moduli funzionali.

source: Types of Users (Roles)
it: Tipologie di Utenti (Ruoli)

source: The user management session allows you to create Users and Users Groups and associate them with specific roles:
it: La sessione di gestione utenti permette di creare **Utenti** e **Gruppi di utenti** ed associarli a ruoli specifici:

source: Admin1: user with full powers including Django administration (basic suite configuration)
it: **`Admin1`**: utente con pieni poteri **compresi** quelli di amministrazione Django (configurazione di base della suite)

source: Admin2: user with full powers excluding those of Django administration (basic configuration of the suite)
it: **`Admin2`**: utente con pieni poteri **esclusi** quelli di amministrazione Django (configurazione di base della suite)

source: Editor1: administrator of one or more Cartographic MacroGroups for which it will be possible:
it: **`Editor1`**: utente **amministratore di uno o più MacroGruppi Cartografici** per i quali avrà la possibilità di

source: create users and/or user groups
it: creare utenti e/o gruppi di utenti

source: create Cartographic Groups and, if necessary, assign them to an Editor 2 user
it: creare Gruppi Cartografici ed, eventualmente, assegnarli ad un utente Editor 2

source: publish WebGis services and define their access policy
it: pubblicare servizi WebGis e definirne la policy di accesso

source: activate and configure some functional modules
it: attivare e configurare alcune tipologie di moduli funzionali

source: Editor2: administrator of one or more Cartographic Groups for which it will be possible:
it: **`Editor2`**: **amministratore di uno o più Gruppi Cartografici** per i quali avrà la possibilità di

source: publish/update WebGis services and define their access policy
it: pubblicare/aggiornare servizi WebGis e definirne la policy di accesso

source: Viewer: user with access permission in consultation on WebGis services characterized by authentication. This user can also use individual functional Modules if the relative permissions have been attributed to him
it: **`Viewer`**: utente con permesso di accesso in **consultazione a servizi WebGis** caratterizzati da autenticazione. L’utente può anche utilizzare singoli Moduli funzionali se gli sono stati attribuiti i relativi permessi

source: Anonymus User: user to be associated with WebGis services and/or functional modules with free access
it: **`Anonymus User`**: utente da associare ai **servizi WebGis e/o ai Moduli funzionali ad accesso libero**

source: Hierarchical organization of contents
it: Organizzazione gerarchica dei contenuti

source: The following paragraph is dedicated to better understanding the relationships between the different types of users and the different elements of the suite (MacroGroups, Map Groups, WebGis services ...).
it: Il seguente paragrafo è dedicato a comprendere al meglio i rapporti tra le diverse tipologie di utenti ed i diversi elementi della suite (MacroGruppi, Gruppi cartografici, servizi WebGis…).

source: It is important to remember that while to publish a WebGis service you must first create a Cartographic Group that contains it, the creation/management of Cartographic MacroGroups (and associated Editor 1 users) is optional.
it: **E’ importante ricordare che mentre per pubblicare un servizio WebGis è necessario prima creare un Gruppo Cartografico che lo contenga, la creazione/gestione dei MacroGruppi Cartografici (e degli utenti Editor 1 associati) è facoltativa.**

source: If the use of MacroGroups is not necessary, the use of Editor 1 users is not recommended.
it: **Nel caso in cui l’utilizzo dei MacroGruppi non sia necessario si SCONSIGLIA l’utilizzo di utenti di tipo Editor 1.**

source: The two cases are described below.
it: Di seguito si riportano quindi le due casistiche:

source: One organization level (absence of MacroGroups)
it: Un livello organizzativo (assenza di MacroGruppi)

source: In case it is not need use MacroGruppi, the Admin user will be the only administrator of the suite and can therefore:
it: In caso di assenza dell'accoppiata MacroGruppi/Editor1, l’utente di tipo **Admin** sarà l’unico amministratore della suite e potrà quindi:

source: create users (individuals and/or groups) of various types
it: creare **utenti** (singoli e/o gruppi) di varia tipologia

source: create Cartographic Groups
it: creare **Gruppi Cartografici**

source: publish WebGis services within the individual Cartographic Groups
it: pubblicare **servizi WebGis** all’interno dei singoli **Gruppi Cartografici**

source: activate some specific modules on individual WebGis services
it: attivare alcuni **moduli specifici** su singoli **servizi WebGis**

source: When creating a cartographic group, the Admin user can define:
it: Al momento della creazione di un Gruppo Cartografico, l’utente Admin può definire:

source: the eventual user (individual/group) Editor 2 to associate the Group with
it: l’eventuale utente (singolo/gruppo) **Editor2** a cui associare il Gruppo stesso

source: Viewers users (individuals/groups) who will have access to this container
it: gli utenti (singoli/gruppi) **Viewers** che avranno accesso a tale contenitore

source: In the event that the Cartographic Group is assigned to Editor 2 (single or group users), they will may autonomously publish/update WebGis services inside in this container.
it: Nel caso in cui il Gruppo Cartografico sia associato ad un un utente o ad un gruppo di utenti di tipo **Editor 2**, questi potranno pubblicare/aggiornare autonomamente servizi WebGis posti in tale contenitore

source: Editor 2 users will also be able to define the access policies to the published WebGis services, limited to the Viewers users associated with the Cartographic Group by the Admin user.
it: Gli utenti **Editor 2** potranno anche definirne le politiche di accesso ai servizi WebGis pubblicati, basandosi sui soli utenti di tipo **Viewers** associati al Gruppo Cartografico dall’utente Admin.

source: Even the Admin user can publish WebGis services within a Cartographic Group and, if necessary, associate them with a user (single and/or group) of Editor 2 type.
it: Anche l’utente **Admin** potrà pubblicare **servizi WebGis** all’interno di un Gruppo Cartografico ed, eventualmente associarli ad un utente (singolo e/o gruppo) di tipo **Editor 2**.

source: Two organization levels (presence of MacroGroups)
it: Due livelli organizzativi (presenza di MacroGruppi)

source: The Macrogroups are thematic containers dedicated to the individual superstructures of your company/public administration (e.g. Municipal Administrations of a Union of Municipalities) within which can be created Cartographic Groups dedicated to individual Services (e.g. Registry Office, Public Works, Urban Planning ...)
it: I **Macrogruppi** sono contenitori tematici dedicati alle singole sovrastrutture dell’Ente (es. Amministrazioni Comunali di un Unione di Comuni) al cui interno potranno essere creati Gruppi Cartografici dedicati ai singoli Servizi (Es. Anagrafe, Lavori Pubblici, Urbanistica...).

source: Each Thematic Group will welcome individual WebGis services.
it: Ogni **Gruppo Cartografico** accoglierà singoli servizi WebGis.

source: Macrogroups can be created only by Admin users.
it: I **Macrogruppi** possono essere creati dal solo utenti di tipo **Admin**.

source: Each Macrogroup can be associated with only one Editor1 user.
it: Ogni **Macrogruppo** può essere associato ad un solo utente di tipo **Eitor1**

source: Each MacroGroup can be considered as a watertight compartment within which the associated Editor 1 user (administrator in full of the MacroGroup), will be able to create users and user groups that will be made available to define access permissions for content (Groups Maps, WebGis services, functional modules ...) of the reference MacroGroup only.
it: Ogni **MacroGruppo può essere considerato come un compartimento stagno** all’interno del quale l’utente Editor 1 associato (amministratore in toto del MacroGruppo), potrà creare utenti e gruppi di utenti che saranno resi disponibili per definire i permessi di accesso relativamente ai contenuti (Gruppi Cartografici, servizi WebGis, moduli funzionali…) del solo MacroGruppo di riferimento.

source: In this way it will be possible to create totally independent entities, the MacroGroups, which will be managed exclusively by the user Editor 1 associated with them.
it: In questo modo sarà possibile creare delle entità totalmente indipendenti tra loro, i MacroGruppi, che saranno gestite, in modo esclusivo, dall’utente Editor1 ad essi associato.

source: Clearly the Admin users (1 and 2) will continue to have full powers on all groups present in the system
it: Chiaramente gli utenti Amministratori (Admin 1 e Admin 2) continueranno ad avere pieni poteri su tutti i MacroGruppi creati.

source: As previously specified, Editor 1 user will be able to:
it: Come precedentemente specificato, l’utente **Editor 1** potrà:

source: create users (single and/or groups) of type Editor2 and Viewer
it: creare **utenti** (singoli e/o gruppi) di tipo Editor2 e Viewer

source: create Cartographic Groups within its Macro Group
it: creare **Gruppi Cartografici** all’interno del proprio **Macrogruppo**

source: publish WebGis services within his Cartographic Groups
it: pubblicare **servizi WebGis** all’interno dei propri **Gruppi Cartografici**

source: activate specific modules on individual WebGis services
it: attivare alcuni **moduli specifici** su singoli **servizi WebGis**

source: When Editor 1 user creates a Cartographic Group, he can define:
it: Al momento della creazione di un Gruppo Cartografico, l’utente Editor 1 può definire:

source: the eventual Editor2 user (individual/group) to associate with this Group
it: l’eventuale utente (singolo/gruppo) **Editor 2** a cui associare il Gruppo stesso

source: Summary table of access/administration policies
it: Tabella riassuntiva delle politihe di accesso e amministrazione

source: Below is a summary table of the powers associated with the different roles.
it: Di seguito una tabella riepilogativa dei poteri associati alle diverse tipologie di utenti.
